{
  "themes": [
    {
      "theme": "Structured Learning Environment",
      "description": "Regular students benefit from following a structured curriculum that supports academic performance",
      "frequency": 4,
      "enrollmentStatus": "Regular",
      "representativeQuotes": [
        "Being a regular or irregular student affects academic achievement because regular students follow a structure curriculum that supports better performancet, while irregular student often face challenges that can hinder their success. ",
        "Very disciplined ako sa studies and I always plan ahead. Nakaka-enjoy yung mga subjects ko this semester.",
        "Consistent ako sa attendance and submissions. Manageable naman yung workload with good planning."
      ]
    },
    {
      "theme": "Catch-up Challenges",
      "description": "Irregular students face difficulties catching up with lessons and maintaining pace",
      "frequency": 11,
      "enrollmentStatus": "Irregular",
      "representativeQuotes": [
        "Nothing, at first glance, appears to be the absence of all things: empty space, silence, a blank page, a void. Yet, when examined more closely, nothing becomes strangely full — full of meaning, contradiction, paradox, and the potential for everything. Writing an essay about nothing seems pointless, but in that very pointlessness lies its purpose. Nothing is not simply the lack of something; it is a concept that shapes everything we understand about existence, perception, and thought.  To begin understanding nothing, one must acknowledge that nothing is never truly nothing. Even the void is defined by what it lacks. When someone says, “There is nothing here,” they are making a statement full of expectation. Nothing becomes a comparison — a contrast to something else. A blank wall tells us something by not showing anything. The silence before a musical performance is not meaningless; it creates tension, anticipation, the quiet foundation upon which melody will rise.  Philosophers have long wrestled with the nature of nothing. In ancient Greece, Parmenides argued that nothing cannot exist because even to speak of nothing is to assign it a form of being. Centuries later, Eastern philosophies embraced nothingness not as a denial of existence but as a pathway to clarity — a space where the mind can rest. In Zen Buddhism, the idea of emptiness (śūnyatā) is not a void but a recognition that meaning is fluid and that form depends on context. Nothing, in that sense, becomes a teacher.  Modern science also grapples with nothing. In physics, even \"empty\" space is far from empty. The vacuum of the universe seethes with energy, virtual particles flickering into being and vanishing again. Quantum fields ripple through what we once thought was nothingness. The cosmos itself emerged from an initial state that might be described as “nothing,” though this nothing contained the potential for all physical laws. In this way, nothing becomes the birthplace of everything.  In daily life, nothing plays a quieter but equally important role. The pause in a conversation, the rest in a song, the blank margins on a page — these spaces of nothing make meaning possible. If every moment were filled, if every surface were crowded, if every silence were drowned by noise, the world would be overwhelming. Nothing provides balance, allowing the mind to breathe. When a person says they want “nothing,” it might be a plea for peace, for a moment without demands or expectations.  Even in art and literature, nothing has value. Negative space brings attention to the subject; the absence of detail invites imagination. Minimalist art leans heavily on nothingness, creating emotional resonance through simplicity. In writing, what is not said can be more powerful than what is said. Entire narratives can hinge on silence, on the things characters never reveal. Nothing becomes a storytelling tool, shaping the emotional landscape.  And yet, despite its philosophical, scientific, and artistic roles, nothing remains elusive. Try to picture nothing, and the mind inevitably conjures something — darkness, emptiness, a blank space — but these are still forms of something. The human mind is not built to comprehend true nothingness. Our thoughts require objects; our imagination relies on imagery. True nothing is beyond reach, forever theoretical, forever slipping away whenever we try to grasp it.  So what does it mean to write an essay about nothing? Perhaps it means accepting that nothing is not trivial at all. Nothing challenges our understanding, forces us to confront the limits of language and imagination, and reminds us that absence is just as meaningful as presence. In a world overflowing with information, noise, and constant motion, nothing becomes rare — even luxurious. The freedom to do nothing, think nothing, or expect nothing can feel like a small revolution.  In the end, nothing is a paradox: a void full of meaning, an absence that creates presence, an emptiness that shapes the world around it. Writing about nothing reveals that nothing is, in its own way, everything.",
        "Medyo struggle ako sa time pero okay naman. Irregular kasi ako so mas challenging talaga yung subjects.",
        "Sobrang hirap mag-catch up sa lessons kasi irregular ako."
      ]
    },
    {
      "theme": "Time Management Concerns",
      "description": "Both groups report challenges with time management and workload balance",
      "frequency": 18,
      "enrollmentStatus": "Both",
      "representativeQuotes": [
        "Because it affected me personally, it made a man out of me, Nothing, at first glance, appears to be the absence of all things: empty space, silence, a blank page, a void. Yet, when examined more closely, nothing becomes strangely full — full of meaning, contradiction, paradox, and the potential for everything. Writing an essay about nothing seems pointless, but in that very pointlessness lies its purpose. Nothing is not simply the lack of something; it is a concept that shapes everything we understand about existence, perception, and thought.  To begin understanding nothing, one must acknowledge that nothing is never truly nothing. Even the void is defined by what it lacks. When someone says, “There is nothing here,” they are making a statement full of expectation. Nothing becomes a comparison — a contrast to something else. A blank wall tells us something by not showing anything. The silence before a musical performance is not meaningless; it creates tension, anticipation, the quiet foundation upon which melody will rise.  Philosophers have long wrestled with the nature of nothing. In ancient Greece, Parmenides argued that nothing cannot exist because even to speak of nothing is to assign it a form of being. Centuries later, Eastern philosophies embraced nothingness not as a denial of existence but as a pathway to clarity — a space where the mind can rest. In Zen Buddhism, the idea of emptiness (śūnyatā) is not a void but a recognition that meaning is fluid and that form depends on context. Nothing, in that sense, becomes a teacher.  Modern science also grapples with nothing. In physics, even \"empty\" space is far from empty. The vacuum of the universe seethes with energy, virtual particles flickering into being and vanishing again. Quantum fields ripple through what we once thought was nothingness. The cosmos itself emerged from an initial state that might be described as “nothing,” though this nothing contained the potential for all physical laws. In this way, nothing becomes the birthplace of everything.  In daily life, nothing plays a quieter but equally important role. The pause in a conversation, the rest in a song, the blank margins on a page — these spaces of nothing make meaning possible. If every moment were filled, if every surface were crowded, if every silence were drowned by noise, the world would be overwhelming. Nothing provides balance, allowing the mind to breathe. When a person says they want “nothing,” it might be a plea for peace, for a moment without demands or expectations.  Even in art and literature, nothing has value. Negative space brings attention to the subject; the absence of detail invites imagination. Minimalist art leans heavily on nothingness, creating emotional resonance through simplicity. In writing, what is not said can be more powerful than what is said. Entire narratives can hinge on silence, on the things characters never reveal. Nothing becomes a storytelling tool, shaping the emotional landscape.  And yet, despite its philosophical, scientific, and artistic roles, nothing remains elusive. Try to picture nothing, and the mind inevitably conjures something — darkness, emptiness, a blank space — but these are still forms of something. The human mind is not built to comprehend true nothingness. Our thoughts require objects; our imagination relies on imagery. True nothing is beyond reach, forever theoretical, forever slipping away whenever we try to grasp it.  So what does it mean to write an essay about nothing? Perhaps it means accepting that nothing is not trivial at all. Nothing challenges our understanding, forces us to confront the limits of language and imagination, and reminds us that absence is just as meaningful as presence. In a world overflowing with information, noise, and constant motion, nothing becomes rare — even luxurious. The freedom to do nothing, think nothing, or expect nothing can feel like a small revolution.  In the end, nothing is a paradox: a void full of meaning, an absence that creates presence, an emptiness that shapes the world around it. Writing about nothing reveals that nothing is, in its own way, everything.",
        "Nag-aadjust lang ako sa study hours depende sa difficulty ng topic.",
        "Nothing, at first glance, appears to be the absence of all things: empty space, silence, a blank page, a void. Yet, when examined more closely, nothing becomes strangely full — full of meaning, contradiction, paradox, and the potential for everything. Writing an essay about nothing seems pointless, but in that very pointlessness lies its purpose. Nothing is not simply the lack of something; it is a concept that shapes everything we understand about existence, perception, and thought.  To begin understanding nothing, one must acknowledge that nothing is never truly nothing. Even the void is defined by what it lacks. When someone says, “There is nothing here,” they are making a statement full of expectation. Nothing becomes a comparison — a contrast to something else. A blank wall tells us something by not showing anything. The silence before a musical performance is not meaningless; it creates tension, anticipation, the quiet foundation upon which melody will rise.  Philosophers have long wrestled with the nature of nothing. In ancient Greece, Parmenides argued that nothing cannot exist because even to speak of nothing is to assign it a form of being. Centuries later, Eastern philosophies embraced nothingness not as a denial of existence but as a pathway to clarity — a space where the mind can rest. In Zen Buddhism, the idea of emptiness (śūnyatā) is not a void but a recognition that meaning is fluid and that form depends on context. Nothing, in that sense, becomes a teacher.  Modern science also grapples with nothing. In physics, even \"empty\" space is far from empty. The vacuum of the universe seethes with energy, virtual particles flickering into being and vanishing again. Quantum fields ripple through what we once thought was nothingness. The cosmos itself emerged from an initial state that might be described as “nothing,” though this nothing contained the potential for all physical laws. In this way, nothing becomes the birthplace of everything.  In daily life, nothing plays a quieter but equally important role. The pause in a conversation, the rest in a song, the blank margins on a page — these spaces of nothing make meaning possible. If every moment were filled, if every surface were crowded, if every silence were drowned by noise, the world would be overwhelming. Nothing provides balance, allowing the mind to breathe. When a person says they want “nothing,” it might be a plea for peace, for a moment without demands or expectations.  Even in art and literature, nothing has value. Negative space brings attention to the subject; the absence of detail invites imagination. Minimalist art leans heavily on nothingness, creating emotional resonance through simplicity. In writing, what is not said can be more powerful than what is said. Entire narratives can hinge on silence, on the things characters never reveal. Nothing becomes a storytelling tool, shaping the emotional landscape.  And yet, despite its philosophical, scientific, and artistic roles, nothing remains elusive. Try to picture nothing, and the mind inevitably conjures something — darkness, emptiness, a blank space — but these are still forms of something. The human mind is not built to comprehend true nothingness. Our thoughts require objects; our imagination relies on imagery. True nothing is beyond reach, forever theoretical, forever slipping away whenever we try to grasp it.  So what does it mean to write an essay about nothing? Perhaps it means accepting that nothing is not trivial at all. Nothing challenges our understanding, forces us to confront the limits of language and imagination, and reminds us that absence is just as meaningful as presence. In a world overflowing with information, noise, and constant motion, nothing becomes rare — even luxurious. The freedom to do nothing, think nothing, or expect nothing can feel like a small revolution.  In the end, nothing is a paradox: a void full of meaning, an absence that creates presence, an emptiness that shapes the world around it. Writing about nothing reveals that nothing is, in its own way, everything.",
        "Medyo struggle ako sa time pero okay naman. Irregular kasi ako so mas challenging talaga yung subjects."
      ]
    }
  ],
  "beliefDistribution": {
    "yes": {
      "regular": 35,
      "irregular": 15
    },
    "no": {
      "regular": 5,
      "irregular": 0
    },
    "maybe": {
      "regular": 15,
      "irregular": 3
    }
  }
}